tomyqg/STM32_RTT_F107/applications/threadlist.c
	/* initialize lwip stack */
	/* register ethernetif device */
	eth_system_device_init();

	/* initialize lwip system */
	lwip_system_init();

#if ECU_JLINK_DEBUG	
	SEGGER_RTT_printf(0,"TCP/IP initialized!\n");
#endif
	rt_kprintf("TCP/IP initialized!\n");
#endif


#ifdef RT_USING_FINSH
	/* initialize finsh */
	finsh_system_init();
	finsh_set_device(RT_CONSOLE_DEVICE_NAME);
#endif
	/* initialize rtc */
	rt_hw_rtc_init();		
		
	/* initialize lock for home/record/data */
	record_data_lock = rt_mutex_create("record_data_lock", RT_IPC_FLAG_FIFO);
	if (record_data_lock != RT_NULL)
	{
#if ECU_JLINK_DEBUG
		SEGGER_RTT_printf(0,"Initialize record_data_lock successful!\n");
#endif 
		rt_kprintf("Initialize record_data_lock successful!\n");
	}
#ifdef WIFI_USE
	/* WiFi Serial Initialize*/
	WiFi_Open();
	//initWorkIP("192.168.1.102",65500,"192.168.1.102",65501);
	//initWorkIP("139.168.200.158",8093,"139.168.200.158",8997);
#endif
	cpu_usage_init();
}

/*****************************************************************************/
/* Function Description:                                                     */
/*****************************************************************************/
/*   WatchDog Monitor program entry                                          */
/*****************************************************************************/
/* Parameters:                                                               */
/*****************************************************************************/
/*   parameter[in]   unused                                                  */
/*****************************************************************************/
/* Return Values:                                                            */
/*****************************************************************************/
/*   void                                                                    */
/*****************************************************************************/
#ifdef THREAD_PRIORITY_WATCHDOG_MONITOR
static void watchdog_monitor_thread_entry(void* parameter)
{
	int abnormalNum = 0;
	rt_thread_delay(RT_TICK_PER_SECOND*4);
  while (1)
  {
		if(
		#ifdef THREAD_PRIORITY_MAIN
				(NULL!= rt_thread_find("main")) &&
		#endif
		#ifdef THREAD_PRIORITY_CONTROL_CLIENT		
				(NULL!= rt_thread_find("control")) &&
		#endif
		#ifdef THREAD_PRIORITY_CLIENT
				(NULL!= rt_thread_find("client")) &&
		#endif
		#ifdef THREAD_PRIORITY_IDWRITE
				(NULL!= rt_thread_find("idwrite")) &&
		#endif
		#ifdef THREAD_PRIORITY_UPDATE
				(NULL!= rt_thread_find("update")) &&
		#endif
		#ifdef THREAD_PRIORITY_PHONE
				(NULL!= rt_thread_find("phone")) &&
		#endif
				1
			)  
		{
			//解除异常状态
			abnormalNum = 0;
			kickwatchdog();
		}else
		{
			//异常状态累加,当连续出现三次异常状态时不在踢狗
			abnormalNum ++;
			if(abnormalNum < 3)
			{
				kickwatchdog();
			}
		}	
		rt_thread_delay(RT_TICK_PER_SECOND*4);
	}
}
#endif

/*****************************************************************************/
/* Function Description:                                                     */
/*****************************************************************************/
/*   LED program entry                                                       */
/*****************************************************************************/
/* Parameters:                                                               */
/*****************************************************************************/
/*   parameter[in]   unused                                                  */
/*****************************************************************************/
/* Return Values:                                                            */
/*****************************************************************************/
/*   void                                                                    */
/*****************************************************************************/
#ifdef THREAD_PRIORITY_LED
static void led_thread_entry(void* parameter)
{
    unsigned int count=0;	
		rt_uint8_t major,minor;
		/* Initialize led */
    rt_hw_led_init();

    while (1)
    {
        /* led1 on */
        count++;
        rt_hw_led_on();
				//rt_kprintf("rt_hw_led_on:%d\n",count);
        rt_thread_delay( RT_TICK_PER_SECOND/2 ); /* sleep 0.5 second and switch to other thread */
			
        rt_hw_led_off();
				//rt_kprintf("rt_hw_led_off:%d\n",count);
        rt_thread_delay( RT_TICK_PER_SECOND/2 );
				cpu_usage_get(&major, &minor);
				//printf("CPU : %d.%d%\n", major, minor);
    }
}
#endif

/*****************************************************************************/
/* Function Description:                                                     */
/*****************************************************************************/
/*   Lan8720 Reset program entry                                             */
/*****************************************************************************/
/* Parameters:                                                               */
/*****************************************************************************/
/*   parameter[in]   unused                                                  */
/*****************************************************************************/
/* Return Values:                                                            */
/*****************************************************************************/
/*   void                                                                    */
/*****************************************************************************/
#ifdef THREAD_PRIORITY_LAN8720_RST
static void lan8720_rst_thread_entry(void* parameter)
{
    int value;
	
	  while (1)
    {
			value = ETH_ReadPHYRegister(0x00, 0);
			
			if(0 == value)	//判断控制寄存器是否变为0  表示断开
			{
				//printf("reg 0:%x\n",value);
				rt_hw_lan8720_rst();
			}
      rt_thread_delay( RT_TICK_PER_SECOND*60 );
    }

}
#endif

/*****************************************************************************/
/* Function Description:                                                     */
/*****************************************************************************/
/*   WiFi Test program entry                                                 */
/*****************************************************************************/
/* Parameters:                                                               */
/*****************************************************************************/
/*   parameter[in]   unused                                                  */
/*****************************************************************************/
/* Return Values:                                                            */
/*****************************************************************************/
/*   void                                                                    */
/*****************************************************************************/
#ifdef THREAD_PRIORITY_WIFI_TEST
#include "datetime.h"
static void wifi_test_thread_entry(void* parameter)
{
	char time[15] = {'\0'};
	char data[28] = "               WIFI_TEST  ";
	int length = 27;
	char ch12 = 'A';
	rt_thread_delay(RT_TICK_PER_SECOND*15);	
	WiFi_Open();
	
	data[26] = '\0';
	while(1)
	{
		getcurrenttime(time);
		memcpy(data,time,14);
		if(ch12 >= 'Z')
		{
			ch12 = 'A';
		}
		data[26] = ch12;
		rt_hw_us_delay(1);
		//printf("%d:%s\n",length,data);
		SendToSocketB(data ,length);
		SendToSocketC(data ,length);
		rt_thread_delay(RT_TICK_PER_SECOND*5);
		ch12++;
	}
}
#endif

/*****************************************************************************/
/* Function Description:                                                     */
/*****************************************************************************/
/*   Zigbee Test program entry                                               */
/*****************************************************************************/
/* Parameters:                                                               */
/*****************************************************************************/
/*   parameter[in]   unused                                                  */
/*****************************************************************************/
/* Return Values:                                                            */
/*****************************************************************************/
/*   void                                                                    */
/*****************************************************************************/
#ifdef THREAD_PRIORITY_ZIGBEE_TEST
static void zigbee_test_thread_entry(void* parameter)
{
	rt_thread_delay(RT_TICK_PER_SECOND*10);
	openzigbee();
	init_ecu();
	while(1)
	{
		zb_change_inverter_channel_one("201703150001", 0x10);
		rt_thread_delay(RT_TICK_PER_SECOND);
	}
	
