tomyqg/STM32_RTT_F107/applications/threadlist.c
}
#endif

/*****************************************************************************/
/* Function Description:                                                     */
/*****************************************************************************/
/*   NTP program entry                                                       */
/*****************************************************************************/
/* Parameters:                                                               */
/*****************************************************************************/
/*   parameter[in]   unused                                                  */
/*****************************************************************************/
/* Return Values:                                                            */
/*****************************************************************************/
/*   void                                                                    */
/*****************************************************************************/
#ifdef THREAD_PRIORITY_NTP
static void ntp_thread_entry(void* parameter)
{
	int i = 0;
	rt_thread_delay(START_TIME_NTP * RT_TICK_PER_SECOND);
	while(1)
	{
		printmsg(ECU_DBG_NTP,"start--------------------------------------------------------");
		i = 0;
		for(i = 0;i < 5;i++)
		{
			if(0 == get_time_from_NTP())
				break;
			rt_thread_delay(RT_TICK_PER_SECOND * 10);
		}
		printmsg(ECU_DBG_NTP,"end----------------------------------------------------------");
		//rt_thread_delay(RT_TICK_PER_SECOND * 60);
		rt_thread_delay(RT_TICK_PER_SECOND * 86400);
		
	}

}
#endif

/*****************************************************************************/
/* Function Description:                                                     */
/*****************************************************************************/
/*   Net Test program entry                                                  */
/*****************************************************************************/
/* Parameters:                                                               */
/*****************************************************************************/
/*   parameter[in]   unused                                                  */
/*****************************************************************************/
/* Return Values:                                                            */
/*****************************************************************************/
/*   void                                                                    */
/*****************************************************************************/
#ifdef THREAD_PRIORITY_NET_TEST
#include "datetime.h"
static void net_test_thread_entry(void* parameter)
{
	char time[15] = {'\0'};
	char send_data[28] = "               NET_TEST   ";
	int length = 27;
	char ch12 = 'A'; 
	struct hostent *host;
	int sock;
	struct sockaddr_in server_addr;
	rt_thread_delay(RT_TICK_PER_SECOND * 10);
	
	
	/* 通过函数入口参数url获得host地址（如果是域名，会做域名解析） */
	host = gethostbyname("192.168.1.103");

	/* 创建一个socket，类型是SOCKET_STREAM，TCP类型 */
	if ((sock = socket(AF_INET, SOCK_STREAM, 0)) == -1)
	{
		/* 创建socket失败 */
		rt_kprintf("Socket error\n");
		return;
	}
	/* 初始化预连接的服务端地址 */
	server_addr.sin_family = AF_INET;
	server_addr.sin_port = htons(65500);
	server_addr.sin_addr = *((struct in_addr *) host->h_addr);
	rt_memset(&(server_addr.sin_zero), 0, sizeof(server_addr.sin_zero));
	/* 连接到服务端 */
	if (connect(sock, (struct sockaddr *) &server_addr,
	sizeof(struct sockaddr)) == -1)
	{
		/* 连接失败 */
		rt_kprintf("Connect error\n");
		/*释放接收缓冲 */
		return;
	}
	while (1)
	{
		getcurrenttime(time);
		memcpy(send_data,time,14);
		if(ch12 >= 'Z')
		{
			ch12 = 'A';
		}
		send_data[26] = ch12;
		send(sock, send_data, length, 0);
		//printf("%d:%s\n",length,send_data);
		rt_thread_delay(RT_TICK_PER_SECOND*10);
		ch12++;
	}

}
#endif

/*****************************************************************************/
/* Function Description:                                                     */
/*****************************************************************************/
/*   Create Application ALL Tasks                                            */
/*****************************************************************************/
/* Parameters:                                                               */
/*****************************************************************************/
/*   void                                                                    */
/*****************************************************************************/
/* Return Values:                                                            */
/*****************************************************************************/
/*   void                                                                    */
/*****************************************************************************/
void tasks_new(void)
{
	rt_err_t result;
	rt_thread_t tid;
	
	/* init init thread */
  tid = rt_thread_create("init",rt_init_thread_entry, RT_NULL,768, THREAD_PRIORITY_INIT, 20);
	if (tid != RT_NULL) rt_thread_startup(tid);
	
#ifdef THREAD_PRIORITY_LED
  /* init led thread */
  result = rt_thread_init(&led_thread,"led",led_thread_entry,RT_NULL,(rt_uint8_t*)&led_stack[0],sizeof(led_stack),THREAD_PRIORITY_LED,5);
  if (result == RT_EOK)	rt_thread_startup(&led_thread);
#endif

#ifdef THREAD_PRIORITY_LAN8720_RST
  /* init LAN8720RST thread */
  result = rt_thread_init(&lan8720_rst_thread,"lanrst",lan8720_rst_thread_entry,RT_NULL,(rt_uint8_t*)&lan8720_rst_stack[0],sizeof(lan8720_rst_stack),THREAD_PRIORITY_LAN8720_RST,5);
  if (result == RT_EOK)	rt_thread_startup(&lan8720_rst_thread);
#endif
	
#ifdef THREAD_PRIORITY_WIFI_TEST
  /* init wifi test thread */
  result = rt_thread_init(&wifi_test_thread,"wifitst",wifi_test_thread_entry,RT_NULL,(rt_uint8_t*)&wifi_test_stack[0],sizeof(wifi_test_stack),THREAD_PRIORITY_WIFI_TEST,5);
  if (result == RT_EOK)	rt_thread_startup(&wifi_test_thread);
#endif	
	
#ifdef THREAD_PRIORITY_NET_TEST
  /* init net test thread */
  result = rt_thread_init(&net_test_thread,"nettst",net_test_thread_entry,RT_NULL,(rt_uint8_t*)&net_test_stack[0],sizeof(net_test_stack),THREAD_PRIORITY_NET_TEST,5);
  if (result == RT_EOK) rt_thread_startup(&net_test_thread);
#endif	

